{
  "titre": "Thierry Vogel – Études de cas infrastructure",
  "court_apropos": "Infrastructure, fiabilité et automatisation chez Orange (2009–2023)",
  "resumes_rapides": [
    {
      "titre": "Augmentation de volumétrie (~2011–2014)",
      "resume": "Script d’abord développé pour mes besoins HPUX/Linux, jugé “inutile” à l’époque. Devenu clé lors d’une migration de 15 000 serveurs. Industrialisation via workflow auto-validant. Impact : fiabilisation multi-OS, réduction massive du temps et des tickets."
    },
    {
      "titre": "Pré-check avant reboot (~2011–2014)",
      "resume": "Audit non intrusif exécuté 2×/jour sur tout le parc. Devenu obligatoire après un incident évitable. Standardisation silencieuse et robuste des bonnes pratiques pré-reboot."
    },
    {
      "titre": "Interopérabilité réseau (~2013–2015)",
      "resume": "Scripts composites NSH/KSH/Perl pour combler les lacunes entre outils internes. Succès là où des millions avaient été dépensés sans résultat. Intégré dans le SI sans réécriture."
    },
    {
      "titre": "Refonte CI/CD sur TCF (2015–2016)",
      "resume": "Refonte complète de la chaîne CI/CD pour une API stratégique : Git, Maven, Jenkins, Ansible. Première mise en œuvre complète de mes compétences DevOps."
    },
    {
      "titre": "Pipelines CI/CD sur KDO & Orange Reprise – Phase 1 (2016–2019)",
      "resume": "Déploiement et maintien de pipelines différenciés entre environnements. Référence DevOps lors des audits internes."
    },
    {
      "titre": "Migration vers Cloud Foundry – Orange Connect (2019–2023)",
      "resume": "Déploiement complet sur Cloud Foundry avec services managés. Coordination multi-équipes et mise en place de CI/CD."
    },
    {
      "titre": "Unification CI/CD sur KDO & Orange Reprise – Phase 2 (2021–2023)",
      "resume": "Unification et migration des chaînes CI/CD vers GitLab CI sur Cloud Foundry. Approche industrialisée et durable."
    },
    {
      "titre": "Exploration entrepreneuriale Web3 (2023–2025)",
      "resume": "Relance personnelle et repositionnement comme Architecte Fiabilité, avec projets open source (WallEx, EasyLandingWeb), rôle bizdev (Thugz), hackathons, événements crypto et engagement Web3 (MonkeDAO, Akash)."
    }
  ],
  "long_apropos": "Entre 2011 et 2015, j’ai occupé un rôle transverse d’automatisation et de fiabilisation chez Orange, en tant qu’ingénieur systèmes spécialisé HPUX et RHEL.\n\nJ’ai fait partie des premiers membres actifs de la communauté ComDev, où j’ai contribué à structurer des outils d’exploitation inter-équipes.\n\nMon approche : comprendre les pratiques terrain, les structurer en scripts composites robustes (NSH, KSH, Perl), et les rendre utilisables par des non-spécialistes sans perdre en fiabilité.\n\nCe document présente trois cas concrets où mes scripts ont été intégrés durablement dans des workflows critiques, souvent industrialisés sans bruit. Ce sont des outils qui ont fonctionné parce qu’ils étaient justes, pas parce qu’ils étaient visibles.",
  "etudes_de_cas": [
    {
      "titre": "Augmentation de volumétrie (2011–2014)",
      "contexte": "Contexte\nÀ l’origine, j’ai développé ce script pour répondre à mes propres besoins : augmenter rapidement et proprement la volumétrie disque sur des serveurs HPUX et RHEL, sans risque ni surcharge administrative.\n\nÀ l’époque, l’intérêt d’un tel outil était contesté. L’opération ne prend “que 10 minutes” manuellement, et les processus (ticket, justification, CSV…) semblaient incompressibles. Pourtant, dès qu’on dépasse quelques serveurs, ce genre d’automatisation fiabilise, réduit l’effort administratif et évite les erreurs invisibles.",
      "declencheur": "Peu après, j’ai reçu une demande d’augmentation de volumétrie sur plusieurs dizaines de serveurs HPUX. En proposant mon script, j’ai découvert que ce n’était pas 50 serveurs — mais le début d’un projet de migration de plus de 15 000 machines, réparties sur des OS très hétérogènes : HP-UX, RHEL (mes spécialités), mais aussi AIX, Solaris, SunOS, chacun en plusieurs versions, avec leurs particularités.",
      "probleme": "",
      "objectif": "",
      "action": [
        "J’ai généralisé le script pour le rendre multi-OS, multi-version, avec :",
        "détection automatique de l’environnement,",
        "adaptation dynamique à la syntaxe et aux erreurs attendues,",
        "logging homogène, structuré et lisible.",
        "Pour les OS hors spécialité, j’ai sollicité directement les admins concernés. Ils m’ont montré leurs méthodes, leurs outils, leurs cas d’usage. Sans leur aide, je n’aurais pas pu garantir la fiabilité du script sur leurs environnements — ni même y accéder."
      ],
      "deploiement": [
        "Le script a rendu possible un pilotage transverse, en permettant :",
        "un lancement massif sans distinction de projet,",
        "une détection automatique de l’OS et de la version,",
        "un comportement sûr même sur des machines non concernées (ex. Windows).",
        "Il a été intégré dans un workflow graphique auto-validant :",
        "détection des tickets ouverts,",
        "exécution par plage horaire,",
        "archivage des résultats,",
        "clôture automatique en cas de succès.",
        "Le chef de projet non-tech pouvait superviser l’opération sans solliciter les équipes techniques. J’étais simplement en backup — rarement sollicité."
      ],
      "impacts": [
        "Projet réalisé en 3 mois au lieu de plus d’un an estimé,",
        "Aucun ticket manuel, aucune intervention admin,",
        "Aucun incident signalé,",
        "Un outil né d’un besoin personnel, devenu une brique structurante.",
        "Sans ce script, l’opération aurait nécessité la mobilisation de nombreuses personnes à travers les différentes entités concernées. Non pas par négligence, mais parce que les projets sont déjà surchargés, et que la lourdeur des processus rend difficile la coordination sur des tâches techniques “simples” à grande échelle.",
        "L’automatisation transverse a permis de désengorger ces circuits, tout en garantissant sécurité, traçabilité et fiabilité."
      ],
      "remarque": ""
    },
    {
      "titre": "🧪 Pré-check avant reboot (2011–2014)",
      "contexte": "",
      "declencheur": "Contexte : Chez Orange, les opérations de maintenance (MCO) impliquaient fréquemment le redémarrage de serveurs critiques. Il n’existait aucune procédure unifiée pour vérifier l’état des systèmes avant reboot. Chaque admin avait ses propres pratiques, souvent non formalisées. Les erreurs ou oublis pouvaient provoquer des incidents graves.",
      "probleme": "",
      "objectif": "",
      "action": [],
      "deploiement": [
        "Il a été intégré dans un workflow transverse d’automatisation :",
        "détection des machines à rebooter,",
        "exécution automatique du script,",
        "archivage des logs,",
        "validation automatique ou blocage en cas de problème détecté.",
        "Fiabilité en production : À l’origine conçu pour un usage ponctuel, le script a été intégré dans une routine d’exploitation. Un soir, le référent Unix remarque que le script tourne sur tout le parc. L’équipe d’automatisation confirme : depuis plusieurs semaines, le script est lancé automatiquement deux fois par jour, sans jamais avoir causé d’incident.",
        "Ce retour inattendu a confirmé la robustesse de l’outil, validé en production à grande échelle."
      ],
      "impacts": [
        "Standardisation des vérifications avant reboot",
        "Réduction des incidents post-maintenance",
        "Intégration dans un workflow automatisé transverse",
        "Fiabilité confirmée à l’échelle du parc"
      ],
      "remarque": ""
    },
    {
      "titre": "Automatisation interopérabilité réseau – Scripts composites",
      "contexte": "Contexte : Vers 2013–2014, Orange utilisait plusieurs outils internes pour la gestion du réseau TCP/IP. Ces outils, développés à différentes époques par différentes équipes, n’étaient pas interopérables. Chaque nouvelle demande réseau nécessitait des manipulations manuelles, des tests séparés, des reformatages, et impliquait de nombreux allers-retours.\n\nDes solutions logicielles sur-étagère avaient été essayées sans succès, malgré des investissements lourds. Le SI était trop hétérogène pour qu’une solution standard s’y adapte simplement.\n\nMon script, développé avec une approche artisanale mais rigoureuse, a fini par répondre aux attentes là où des outils coûteux avaient échoué.",
      "declencheur": "",
      "probleme": "",
      "objectif": "- recevoir des données en entrée selon un format réseau strict,\n- déclencher des tests réseau automatisés,\n- transformer les résultats dans un format exploitable par d’autres outils,\n- transmettre les données à l’étape suivante du processus.",
      "action": [
        "Je travaillais en collaboration avec les admins réseau, sur la base de retours fonctionnels. Je n’avais pas accès au SI final ni à la chaîne complète, mais mes livraisons étaient ajustées par itérations selon leurs retours."
      ],
      "deploiement": [
        "les scripts avaient été intégrés dans leur SI (modalité exacte inconnue),",
        "ils avaient permis de réduire les échecs de livraison réseau,",
        "et de fiabiliser un maillon critique de la chaîne de configuration."
      ],
      "impacts": [
        "Réduction des erreurs dans les demandes réseau",
        "Automatisation de tâches auparavant manuelles",
        "Amélioration de la fluidité dans la chaîne de livraison réseau",
        "Intégration dans les workflows, même hors de mon périmètre",
        "Scripts composites signés et utilisés sans refactorisation lourde"
      ],
      "remarque": ""
    },
    {
      "titre": "Refonte CI/CD sur TCF (2015–2016)",
      "contexte": "Une API de consolidation de référentiels nécessitait une chaîne d’intégration continue fiable et structurée.",
      "objectif": "Moderniser la chaîne de livraison de l’API : passage à Git, standardisation build, automatisation des déploiements.",
      "action": [
        "Migration de CVS vers Git avec adoption du modèle GitFlow",
        "Structuration du build Maven et intégration continue avec Jenkins et Nexus",
        "Déploiement automatisé via Ansible sur tous les environnements (y compris production)",
        "Collaboration directe avec la communauté Ansible pendant une période instable"
      ],
      "deploiement": [
        "CI/CD complet mis en place et utilisé en production",
        "Stabilisation rapide des livraisons grâce aux automatisations",
        "Autonomie accrue des développeurs"
      ],
      "impacts": [
        "Réduction des erreurs humaines",
        "Fiabilisation de la livraison de l’API",
        "Montée en compétence collective sur Git/CI"
      ],
      "remarque": "Première mise en pratique complète de mes compétences CI/CD sur un projet métier clé."
    },
    {
      "titre": "Pipelines CI/CD sur KDO & Orange Reprise – Phase 1 (2016–2019)",
      "contexte": "Deux projets majeurs lancés simultanément nécessitaient une automatisation complète dès le début.",
      "objectif": "Concevoir des chaînes CI/CD différenciées, adaptées aux équipes et aux environnements.",
      "action": [
        "Déploiement initial avec Git, Jenkins, Nexus, Ansible",
        "Migration progressive vers GitLab CI",
        "Automatisation des migrations BDD avec mécanisme de rollback sécurisé",
        "Support de pipelines différenciés entre environnement recette, préprod et production"
      ],
      "deploiement": [
        "Chaînes en place et maintenues en conditions opérationnelles",
        "Références internes lors des audits DevOps de 2017"
      ],
      "impacts": [
        "Accélération des cycles de livraison",
        "Réduction des erreurs sur la base de données",
        "Exemplarité DevOps reconnue en interne"
      ],
      "remarque": "J’ai été à la fois concepteur, opérateur et garant du bon fonctionnement dans la durée."
    },
    {
      "titre": "Migration vers Cloud Foundry – Orange Connect (2019–2023)",
      "contexte": "Un projet de gestion d'identité multi-équipes nécessitait un déploiement cloud sécurisé et modulaire.",
      "objectif": "Déployer l’application sur Cloud Foundry avec tous les services managés associés.",
      "action": [
        "Configuration des environnements sur Cloud Foundry",
        "Choix des services managés (PostgreSQL, Vault, S3...)",
        "Mise en place des pipelines CI/CD adaptés",
        "Coordination multi-équipes et gestion des accès"
      ],
      "deploiement": [
        "Déploiement réussi de bout en bout",
        "Capitalisation sur cette expérience pour les migrations suivantes"
      ],
      "impacts": [
        "Fiabilisation du socle Cloud",
        "Amélioration de la coordination entre équipes",
        "Déploiement sécurisé avec services managés"
      ],
      "remarque": "Première expérience structurante sur Cloud Foundry, répliquée ensuite sur d’autres projets."
    },
    {
      "titre": "Unification CI/CD sur KDO & Orange Reprise – Phase 2 (2021–2023)",
      "contexte": "Suite à la migration réussie d’Orange Connect, KDO et Orange Reprise ont migré à leur tour vers Cloud Foundry.",
      "objectif": "Unifier les pipelines CI/CD pour fiabiliser les déploiements sur la plateforme cloud.",
      "action": [
        "Migration de Jenkins/Ansible vers GitLab CI",
        "Unification des chaînes CI/CD des deux projets",
        "Utilisation des services managés Cloud Foundry"
      ],
      "deploiement": [
        "Chaînes CI/CD consolidées et déployées",
        "Usage standardisé des services cloud internes"
      ],
      "impacts": [
        "Réduction du coût de maintenance",
        "Industrialisation des bonnes pratiques cloud",
        "Autonomie accrue des équipes techniques"
      ],
      "remarque": "Cette phase a tiré profit des succès précédents pour aboutir à une solution durable et cohérente."
    },
    {
      "titre": "Exploration entrepreneuriale et engagement Web3 (2023–2025)",
      "contexte": "Après une phase intense dans des environnements critiques, j’ai pris le temps de réorienter mes compétences vers des domaines émergents à fort potentiel d’impact.",
      "objectif": "Explorer les usages concrets du Web3, tester des idées de produits utiles et renforcer mon autonomie technique et stratégique.",
      "action": [
        "Création de WallEx, un explorateur de wallets crypto multichaînes",
        "Participation à plusieurs hackathons dont Superteam France",
        "Rôle de business developer pour Thugz (intégration Web3 dans Unreal Engine)",
        "Création d’EasyLandingWeb, un générateur intelligent de landing pages statiques",
        "Veille et participation à l’écosystème Akash Network (cloud décentralisé)",
        "Engagement communautaire via MonkeDAO",
        "Participation à de nombreux événements crypto et blockchain en France"
      ],
      "deploiement": [
        "Prototypes fonctionnels (WallEx, EasyLandingWeb) présentés publiquement",
        "Collaboration avec des équipes internationales (Superteam, Thugz)",
        "Création d’une présence technique sur GitHub et lors d’événements"
      ],
      "impacts": [
        "Consolidation de compétences en développement produit",
        "Renforcement du positionnement Web3/entrepreneuriat",
        "Ouverture à de nouveaux réseaux et opportunités"
      ],
      "remarque": "Cette période a permis de relancer ma dynamique personnelle tout en consolidant un nouveau positionnement professionnel : Architecte Fiabilité, avec un intérêt prononcé pour les cas d’usage concrets et utiles du Web3."
    }
  ],
  "et_aujourdhui": "Je me positionne aujourd’hui comme Architecte Fiabilité, à l’intersection des enjeux Ops, sécurité et continuité métier.\nJ’apporte des solutions robustes, lisibles et durables, alignées avec les réalités humaines du terrain.\n\nDepuis 2015, j’ai consolidé ma pratique DevOps dans des environnements complexes et critiques, en automatisant l’intégration et le déploiement de projets structurants :\n- CI/CD complet avec Jenkins, GitLab CI, Nexus, SonarQube,\n- Conteneurisation via Docker dès 2017,\n- Référence DevOps Cloud Foundry dans le groupe Orange.\n\nEntre 2023 et 2025, j’ai traversé une phase de transition personnelle et professionnelle. J’en ai profité pour approfondir mes connaissances en finance décentralisée, participer à des hackathons Web3, et développer plusieurs projets techniques et open source (WallEx, EasyLandingWeb).\n\nJe ne recherche pas la lumière ni les titres. Mon rôle est souvent de poser les bases techniques solides, de résoudre les nœuds critiques, puis de laisser place à l’équipe.\nJe m’engage avec rigueur, j’agis quand c’est nécessaire, mais je ne cherche pas à me mettre en avant.\n\nAujourd’hui, je souhaite travailler dans des environnements où la fiabilité, l’autonomie et le sens du travail bien fait sont reconnus.",
  "pied_de_page": "Généré avec l’aide de ChatGPT, Grok et Bolt ❤️"
}
